Documents/ЛБ_АкцииПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_АкцииПроцентныеСтавки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_АкцииПроцентныеСтавки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияСтавкиПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановитьЗначениеИлиОтконение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_УстановкаЗначенияИлиОтклонения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_АкцииПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_АкцииПроцентныеСтавки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_АкцииПроцентныеСтавки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокумента(ТаблицаСтавок) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Ссылка.Акция КАК Акция,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.ПричинаПрименения КАК ПричинаПрименения,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.СтатусЗалогодателя КАК СтатусЗалогодателя,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.ДиапазонСумм КАК ДиапазонСумм,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.СхемаРасчетаПроцентов КАК СхемаРасчетаПроцентов,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.УстановитьЗначениеИлиОтконение КАК УстановитьЗначениеИлиОтконение,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Ставка КАК Ставка,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Отклонение КАК Отклонение,
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_АкцииПроцентныеСтавки.УсловияСтавкиПроцентов КАК ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов
	               |ГДЕ
	               |	ЛБ_АкцииПроцентныеСтавкиСтавкиПроцентов.Ссылка = &Ссылка";
		
	РезультатЗапроса = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаСтавок = ПодготовитьТаблицуСтавок(РезультатЗапроса);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуСтавок(РезультатЗапроса) Экспорт

	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	ТаблицаСтавок = ТаблицаЗапроса.Скопировать();
	ТаблицаСтавок.Очистить();
	ТаблицаСтавок.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) И НЕ ЗначениеЗаполнено(Стр.ЗначениеОтклонения) Тогда
					Продолжить;
				КонецЕсли;	     
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка;  
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм; 
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов; 
				НоваяСтр.Ставка = Стр.Ставка;
				НоваяСтр.Отклонение = Стр.Отклонение;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;  
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если НЕ ЗначениеЗаполнено(Стр.Ставка) И НЕ ЗначениеЗаполнено(Стр.ЗначениеОтклонения) Тогда
					Продолжить;
				КонецЕсли;	  
				НоваяСтр = ТаблицаСтавок.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард.Ссылка;  
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
	            НоваяСтр.ДиапазонСумм = Стр.ДиапазонСумм;  
				НоваяСтр.СхемаРасчетаПроцентов = Стр.СхемаРасчетаПроцентов;
				НоваяСтр.Ставка = Стр.Ставка;   
				НоваяСтр.Отклонение = Стр.Отклонение;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения; 
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаСтавок;

КонецФункции // ПодготовитьТаблицуТоваров()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ)
	
	Движения.ЛБ_АкцииПроцентныеСтавки.Записывать = Истина;
    Для Каждого ТекСтрокаС Из ТаблицаСтавок Цикл
		Движение = Движения.ЛБ_АкцииПроцентныеСтавки.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));
		Движение.ДатаОкончанияДействия = ДатаОкончанияДействия; 
		Движение.Акция = ТекСтрокаС.Акция;
		Движение.Ломбард = ТекСтрокаС.Ломбард;
		Движение.ПричинаПрименения = ТекСтрокаС.ПричинаПрименения;
		Движение.СхемаКредитования = ТекСтрокаС.СхемаКредитования;
		Движение.СтатусЗалогодателя = ТекСтрокаС.СтатусЗалогодателя;
        Движение.ДиапазонСуммЗайма = ТекСтрокаС.ДиапазонСумм;
		Движение.СхемаРасчетаПроцентов = ТекСтрокаС.СхемаРасчетаПроцентов;
		Движение.ПроцентнаяСтавка = ТекСтрокаС.Ставка;   
		Движение.Отклонение = ТекСтрокаС.Отклонение; 
		Движение.ЗначениеОтклонения = ТекСтрокаС.ЗначениеОтклонения;
	КонецЦикла;
		
КонецПроцедуры // ДвиженияПоРегистрам()

#Область ОбработчикиСобытий
// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	ЛБ_ОбщийМодуль.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаСтавок;
	
	ПодготовитьТаблицыДокумента(ТаблицаСтавок);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаСтавок, Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#КонецЕсли
